import { MdNavigateNext } from "react-icons/md";
import { GrFormPrevious } from "react-icons/gr";


const Blogdetails = () => {
    return (
        <div className="mx-10 md:mx-16 lg:mx-24 xl:mx-36 mt-12">
            <div className="mb-8">
                <h2 className="text-[20px] font-bold mb-3">چند توصیه مهم</h2>
                <div className="flex">
                    <p className="ml-3 text-[#7a7a7a] text-[16px]">منتشر شده توسط <span className="text-[#eb3e32]">ادمین</span></p>
                    <p className="ml-3 text-[#7a7a7a] text-[16px]">18 آبان 1403</p>
                </div>
            </div>
            <img className="w-full mb-12" src={require("../../../img/blog5.jpg")} alt="blog-img" />
            <p className="text-[14px] text-justify">
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                <br /><br />
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                <br /><br />
                لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                <br /><br />
            </p>
            <div className="flex mt-10 gap-x-5 mb-16">
                    <button className="hover:bg-[#464f5d] gap-x-1 px-6 py-3 text-white rounded-3xl flex text-[16px] bg-[#363f4d] transition-colors duration-300">
                        <span className="m-auto text-[22px]"><MdNavigateNext /></span>
                        پست بعدی
                    </button>
                    <button className="hover:bg-[#464f5d] gap-x-1 px-6 py-3 text-white rounded-3xl flex text-[16px] bg-[#363f4d] transition-colors duration-300">
                        پست قبلی
                        <span className="m-auto text-[22px]"><GrFormPrevious /></span>
                    </button>
            </div>
        </div>
    )
}

export default Blogdetails